In [1]:
import pandas as pd
import numpy as np
eps = np.finfo(float).eps
from numpy import log2 as log

In [2]:
#entropy_node = 0

In [3]:
#def entropy(fraction):
#    entropy_node += -fraction*np.log2(fraction)

In [4]:
train = pd.read_csv(r"C:\Users\Ruchi\Documents\titanic_train.csv")
test = pd.read_csv(r"C:\Users\Ruchi\Documents\titanic_test.csv")

In [5]:
org_train = train.copy()
org_test = test.copy()

In [6]:
data = train.append(test, sort = True)

In [7]:
#data.info()
total_pass = 1309
print(data)

      age boat   body    cabin embarked      fare  \
0     NaN   13    NaN      NaN        Q    7.7333
1    38.0  NaN    NaN      NaN        S    8.6625
2    30.0  NaN    NaN      NaN        S   24.1500
3    54.0    4    NaN      NaN        S   23.0000
4    40.0  NaN    NaN      NaN        S   13.0000
5    28.0  NaN  173.0      NaN        S   22.5250
6    19.0  NaN    NaN      NaN        S    0.0000
7    30.0   10    NaN      NaN        S   13.0000
8    22.0    C    NaN      NaN        S    7.7750
9    21.0  NaN    NaN      NaN        S    9.8250
10   27.0  NaN    NaN      C82        C  211.5000
11   60.0    8    NaN      D15        C   76.2917
12   56.0    7    NaN      C50        C   83.1583
13   20.0    4    NaN      NaN        S   23.0000
14   16.0  NaN  190.0      NaN        S   20.2500
15   48.0  NaN    NaN      NaN        S    7.8542
16   40.0  NaN    NaN      NaN        S   16.0000
17    NaN   16    NaN      NaN        Q   23.2500
18   22.0    6    NaN      E33        S   55.0000
19   32.0    A    NaN      NaN        S    7.7750
20   27.0   15    NaN      NaN        S    8.6625
21    NaN  NaN    NaN      NaN        Q    8.4583
22   24.0    9    NaN      NaN        S   65.0000
23   25.0  NaN    NaN      NaN        S    7.8958
24   18.0    C    NaN      NaN        S    8.0500
25   27.0  NaN    NaN      NaN        S   26.0000
26   35.0  NaN    NaN      NaN        Q    7.7500
27   27.0  NaN    NaN      NaN        S   21.0000
28    NaN  NaN    NaN      NaN        C    7.2292
29   42.0  NaN   38.0      NaN        S   52.0000
..    ...  ...    ...      ...      ...       ...
429  21.0   12    NaN      NaN        S   21.0000
430  24.0   15    NaN      NaN        Q    7.7500
431  24.0    4    NaN      NaN        S   14.5000
432  41.0  NaN    NaN      NaN        S   20.2125
433  59.0  NaN    NaN      NaN        S    7.2500
434  39.0    8    NaN     C105        C  108.9000
435  22.0  NaN    NaN      NaN        S    7.5208
436   8.0   14    NaN      NaN        S   26.2500
437  18.0  NaN    NaN      NaN        S    7.7750
438  33.0    8    NaN      NaN        S  151.5500
439  26.0  NaN    NaN      NaN        S    7.9250
440   NaN  NaN    NaN      NaN        S    7.2500
441  30.0  NaN    NaN      NaN        C    7.2292
442  45.0    7    NaN  D10 D12        C   63.3583
443  63.0   10    NaN       D7        S   77.9583
444  58.0    8    NaN     C103        S   26.5500
445   9.0  NaN    NaN      NaN        S   27.9000
446  28.0  NaN    NaN      NaN        S   26.0000
447   NaN  NaN    NaN     C128        S   35.0000
448  33.0  NaN    NaN      NaN        S   12.2750
449  27.0    3    NaN      B71        S   52.0000
450  24.0    7    NaN      B45        S   82.2667
451   NaN  NaN    NaN      NaN        S    8.0500
452  21.0  NaN    NaN      NaN        S    6.4958
453  22.0    8    NaN       C2        S   66.6000
454   NaN  NaN    NaN      NaN        S    7.8958
455  23.0  NaN    NaN      NaN        S   13.0000
456   NaN    4    NaN      NaN        C  110.8833
457  16.0  NaN    NaN      NaN        S   10.5000
458  10.0  NaN    NaN      NaN        S   24.1500

                                   home.dest  \
0                                        NaN
1                                    Croatia
2                                        NaN
3                       Cornwall / Akron, OH
4                   Barre, Co Washington, VT
5                                        NaN
6                                        NaN
7                   Finland / Washington, DC
8                                        NaN
9                                        NaN
10                           Elkins Park, PA
11                          Philadelphia, PA
12                 Mt Airy, Philadelphia, PA
13                      Cornwall / Akron, OH
14                       East Providence, RI
15                                       NaN
16         Weston-Super-Mare / Moose Jaw, SK
17                                       NaN
18          St Leonards-on-Sea, England Ohio
19                                       NaN
20                                       NaN
21                                       NaN
22              Somerset / Bernardsville, NJ
23                                       NaN
24                     London Skanteales, NY
25                          Hornsey, England
26                                       NaN
27                         Plymouth, England
28                                       NaN
29                              New York, NY
..                                       ...
429                        Ilfracombe, Devon
430                                      NaN
431                              Detroit, MI
432                                      NaN
433                              Merrill, WI
434                                      NaN
435                                      NaN
436  Bishopstoke, Hants / Fayette Valley, ID
437                 Tofta, Sweden Joliet, IL
438                                      NaN
439                                      NaN
440                                      NaN
441                                      NaN
442                             New York, NY
443                               Hudson, NY
444        Birkdale, England Cleveland, Ohio
445                                      NaN
446                                  England
447                          London, England
448                         Philadelphia, PA
449                             Montreal, PQ
450                          Minneapolis, MN
451                                      NaN
452                                      NaN
453                       Isleworth, England
454                                      NaN
455                    England / Detroit, MI
456                                      NaN
457                      Halesworth, England
458                                      NaN

                                                  name  parch  passenger_id  \
0                                   Smyth, Miss. Julia      0          1216
1                                      Cacic, Mr. Luka      0           699
2    Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...      1          1267
3                Hocking, Mrs. Elizabeth (Eliza Needs)      3           449
4                                      Veal, Mr. James      0           576
5                             Olsen, Mr. Henry Margido      0          1083
6                      Johnson, Mr. William Cahoone Jr      0           898
7                                Sinkkonen, Miss. Anna      0           560
8                                   Ohman, Miss. Velin      0          1079
9                             Jussila, Miss. Mari Aina      0           908
10                           Widener, Mr. Harry Elkins      2           313
11     Bucknell, Mrs. William Robert (Emma Eliza Ward)      0            43
12       Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)      1           233
13                       Hocking, Miss. Ellen "Nellie"      1           446
14                         Abbott, Mr. Rossmore Edward      1           602
15                             Jensen, Mr. Niels Peder      0           884
16                           Maybery, Mr. Frank Hubert      0           497
17                                  McCoy, Mr. Bernard      0          1003
18                         Bowerman, Miss. Elsie Edith      1            36
19                           Olsson, Mr. Oscar Wilhelm      0          1088
20                                   Lulic, Mr. Nikola      0           978
21                                    Moran, Mr. James      0          1030
22                                  Herman, Miss. Kate      2           438
23                                  Delalic, Mr. Redjo      0           766
24                          Badman, Miss. Emily Louisa      0           661
25                         Sharp, Mr. Percival James R      0           556
26                            McGowan, Miss. Katherine      0          1008
27   Turpin, Mrs. William John Robert (Dorothy Ann ...      0           575
28                                 Doharr, Mr. Tannous      0           775
29                      Holverson, Mr. Alexander Oskar      0           162
..                                                 ...    ...           ...
429               Phillips, Miss. Alice Frances Louisa      1           533
430                          Mulvihill, Miss. Bertha E      0          1040
431                    Hamalainen, Mrs. William (Anna)      2           428
432           Rosblom, Mrs. Viktor (Helena Wilhelmina)      2          1158
433                                  Coxon, Mr. Daniel      0           736
434                       Oliva y Ocana, Dona. Fermina      0           218
435                          Karlsson, Mr. Nils August      0           915
436                   Collyer, Miss. Marjorie "Lottie"      2           377
437                     Edvardsson, Mr. Gustaf Hjalmar      0           786
438                               Daniels, Miss. Sarah      0            88
439                             Heikkinen, Miss. Laina      0           860
440                             Wiseman, Mr. Phillippe      0          1297
441                       Ibrahim Shawah, Mr. Yousseff      0           875
442       Greenfield, Mrs. Leo David (Blanche Strouse)      1           141
443                  Andrews, Miss. Kornelia Theodosia      0             6
444                           Bonnell, Miss. Elizabeth      0            33
445                                 Skoog, Miss. Mabel      2          1208
446                         Beauchamp, Mr. Henry James      0           338
447             Williams-Lambert, Mr. Fletcher Fellows      0           318
448                             Hunt, Mr. George Henry      0           457
449               Davidson, Mrs. Thornton (Orian Hays)      2            90
450                         Snyder, Mr. John Pillsbury      0           271
451                                   Miles, Mr. Frank      0          1018
452                            Wiklund, Mr. Karl Johan      0          1289
453                  Pears, Mrs. Thomas (Edith Wearne)      0           227
454                                 Sdycoff, Mr. Todor      0          1194
455                       Eitemiller, Mr. George Floyd      0           403
456                            Fleming, Miss. Margaret      0           108
457                           Mudd, Mr. Thomas Charles      0           510
458                          Van Impe, Miss. Catharina      2          1265

     pclass     sex  sibsp  survived            ticket
0         3  female      0       1.0            335432
1         3    male      0       0.0            315089
2         3  female      1       0.0            345773
3         2  female      1       1.0             29105
4         2    male      0       0.0             28221
5         3    male      0       0.0            C 4001
6         3    male      0       0.0              LINE
7         2  female      0       1.0            250648
8         3  female      0       1.0            347085
9         3  female      1       0.0              4137
10        1    male      0       0.0            113503
11        1  female      0       1.0             11813
12        1  female      0       1.0             11767
13        2  female      2       1.0             29105
14        3    male      1       0.0         C.A. 2673
15        3    male      0       0.0            350047
16        2    male      0       0.0            239059
17        3    male      2       1.0            367226
18        1  female      0       1.0            113505
19        3    male      0       1.0            347079
20        3    male      0       1.0            315098
21        3    male      0       0.0            330877
22        2  female      1       1.0            220845
23        3    male      0       0.0            349250
24        3  female      0       1.0         A/4 31416
25        2    male      0       0.0            244358
26        3  female      0       0.0              9232
27        2  female      1       0.0             11668
28        3    male      0       0.0              2686
29        1    male      1       0.0            113789
..      ...     ...    ...       ...               ...
429       2  female      0       NaN       S.O./P.P. 2
430       3  female      0       NaN            382653
431       2  female      0       NaN            250649
432       3  female      0       NaN            370129
433       3    male      0       NaN            364500
434       1  female      0       NaN          PC 17758
435       3    male      0       NaN            350060
436       2  female      0       NaN        C.A. 31921
437       3    male      0       NaN            349912
438       1  female      0       NaN            113781
439       3  female      0       NaN  STON/O2. 3101282
440       3    male      0       NaN        A/4. 34244
441       3    male      0       NaN              2685
442       1  female      0       NaN          PC 17759
443       1  female      1       NaN             13502
444       1  female      0       NaN            113783
445       3  female      3       NaN            347088
446       2    male      0       NaN            244358
447       1    male      0       NaN            113510
448       2    male      0       NaN        SCO/W 1585
449       1  female      1       NaN        F.C. 12750
450       1    male      1       NaN             21228
451       3    male      0       NaN            359306
452       3    male      1       NaN           3101266
453       1  female      1       NaN            113776
454       3    male      0       NaN            349222
455       2    male      0       NaN             29751
456       1  female      0       NaN             17421
457       2    male      0       NaN       S.O./P.P. 3
458       3  female      0       NaN            345773

[1309 rows x 15 columns]

In [8]:
# Clean NA data
data.age.fillna(value = data.age.mean(), inplace = True)
data.fare.fillna(value = data.fare.mean(), inplace = True)
# Fill NA embarked values with the mode of embarked values
data.embarked.fillna(value=(data.embarked.value_counts().idxmax()), inplace=True)
data.survived.fillna(value=-1, inplace=True) 
data.boat.fillna(value = 0, inplace = True)
data['sex'] =  data['sex'].map( {'female': 0, 'male': 1} ).astype(int)
#Grouping ages
data.loc[data['age'] <= 16, 'age'] = 0
data.loc[(data['age'] > 16) & (data['age'] < 50), 'age'] = 1
data.loc[data['age'] >= 50, 'age'] = 2

In [9]:
print(data)

     age boat   body    cabin embarked      fare  \
0    1.0   13    NaN      NaN        Q    7.7333
1    1.0    0    NaN      NaN        S    8.6625
2    1.0    0    NaN      NaN        S   24.1500
3    2.0    4    NaN      NaN        S   23.0000
4    1.0    0    NaN      NaN        S   13.0000
5    1.0    0  173.0      NaN        S   22.5250
6    1.0    0    NaN      NaN        S    0.0000
7    1.0   10    NaN      NaN        S   13.0000
8    1.0    C    NaN      NaN        S    7.7750
9    1.0    0    NaN      NaN        S    9.8250
10   1.0    0    NaN      C82        C  211.5000
11   2.0    8    NaN      D15        C   76.2917
12   2.0    7    NaN      C50        C   83.1583
13   1.0    4    NaN      NaN        S   23.0000
14   0.0    0  190.0      NaN        S   20.2500
15   1.0    0    NaN      NaN        S    7.8542
16   1.0    0    NaN      NaN        S   16.0000
17   1.0   16    NaN      NaN        Q   23.2500
18   1.0    6    NaN      E33        S   55.0000
19   1.0    A    NaN      NaN        S    7.7750
20   1.0   15    NaN      NaN        S    8.6625
21   1.0    0    NaN      NaN        Q    8.4583
22   1.0    9    NaN      NaN        S   65.0000
23   1.0    0    NaN      NaN        S    7.8958
24   1.0    C    NaN      NaN        S    8.0500
25   1.0    0    NaN      NaN        S   26.0000
26   1.0    0    NaN      NaN        Q    7.7500
27   1.0    0    NaN      NaN        S   21.0000
28   1.0    0    NaN      NaN        C    7.2292
29   1.0    0   38.0      NaN        S   52.0000
..   ...  ...    ...      ...      ...       ...
429  1.0   12    NaN      NaN        S   21.0000
430  1.0   15    NaN      NaN        Q    7.7500
431  1.0    4    NaN      NaN        S   14.5000
432  1.0    0    NaN      NaN        S   20.2125
433  2.0    0    NaN      NaN        S    7.2500
434  1.0    8    NaN     C105        C  108.9000
435  1.0    0    NaN      NaN        S    7.5208
436  0.0   14    NaN      NaN        S   26.2500
437  1.0    0    NaN      NaN        S    7.7750
438  1.0    8    NaN      NaN        S  151.5500
439  1.0    0    NaN      NaN        S    7.9250
440  1.0    0    NaN      NaN        S    7.2500
441  1.0    0    NaN      NaN        C    7.2292
442  1.0    7    NaN  D10 D12        C   63.3583
443  2.0   10    NaN       D7        S   77.9583
444  2.0    8    NaN     C103        S   26.5500
445  0.0    0    NaN      NaN        S   27.9000
446  1.0    0    NaN      NaN        S   26.0000
447  1.0    0    NaN     C128        S   35.0000
448  1.0    0    NaN      NaN        S   12.2750
449  1.0    3    NaN      B71        S   52.0000
450  1.0    7    NaN      B45        S   82.2667
451  1.0    0    NaN      NaN        S    8.0500
452  1.0    0    NaN      NaN        S    6.4958
453  1.0    8    NaN       C2        S   66.6000
454  1.0    0    NaN      NaN        S    7.8958
455  1.0    0    NaN      NaN        S   13.0000
456  1.0    4    NaN      NaN        C  110.8833
457  0.0    0    NaN      NaN        S   10.5000
458  0.0    0    NaN      NaN        S   24.1500

                                   home.dest  \
0                                        NaN
1                                    Croatia
2                                        NaN
3                       Cornwall / Akron, OH
4                   Barre, Co Washington, VT
5                                        NaN
6                                        NaN
7                   Finland / Washington, DC
8                                        NaN
9                                        NaN
10                           Elkins Park, PA
11                          Philadelphia, PA
12                 Mt Airy, Philadelphia, PA
13                      Cornwall / Akron, OH
14                       East Providence, RI
15                                       NaN
16         Weston-Super-Mare / Moose Jaw, SK
17                                       NaN
18          St Leonards-on-Sea, England Ohio
19                                       NaN
20                                       NaN
21                                       NaN
22              Somerset / Bernardsville, NJ
23                                       NaN
24                     London Skanteales, NY
25                          Hornsey, England
26                                       NaN
27                         Plymouth, England
28                                       NaN
29                              New York, NY
..                                       ...
429                        Ilfracombe, Devon
430                                      NaN
431                              Detroit, MI
432                                      NaN
433                              Merrill, WI
434                                      NaN
435                                      NaN
436  Bishopstoke, Hants / Fayette Valley, ID
437                 Tofta, Sweden Joliet, IL
438                                      NaN
439                                      NaN
440                                      NaN
441                                      NaN
442                             New York, NY
443                               Hudson, NY
444        Birkdale, England Cleveland, Ohio
445                                      NaN
446                                  England
447                          London, England
448                         Philadelphia, PA
449                             Montreal, PQ
450                          Minneapolis, MN
451                                      NaN
452                                      NaN
453                       Isleworth, England
454                                      NaN
455                    England / Detroit, MI
456                                      NaN
457                      Halesworth, England
458                                      NaN

                                                  name  parch  passenger_id  \
0                                   Smyth, Miss. Julia      0          1216
1                                      Cacic, Mr. Luka      0           699
2    Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...      1          1267
3                Hocking, Mrs. Elizabeth (Eliza Needs)      3           449
4                                      Veal, Mr. James      0           576
5                             Olsen, Mr. Henry Margido      0          1083
6                      Johnson, Mr. William Cahoone Jr      0           898
7                                Sinkkonen, Miss. Anna      0           560
8                                   Ohman, Miss. Velin      0          1079
9                             Jussila, Miss. Mari Aina      0           908
10                           Widener, Mr. Harry Elkins      2           313
11     Bucknell, Mrs. William Robert (Emma Eliza Ward)      0            43
12       Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)      1           233
13                       Hocking, Miss. Ellen "Nellie"      1           446
14                         Abbott, Mr. Rossmore Edward      1           602
15                             Jensen, Mr. Niels Peder      0           884
16                           Maybery, Mr. Frank Hubert      0           497
17                                  McCoy, Mr. Bernard      0          1003
18                         Bowerman, Miss. Elsie Edith      1            36
19                           Olsson, Mr. Oscar Wilhelm      0          1088
20                                   Lulic, Mr. Nikola      0           978
21                                    Moran, Mr. James      0          1030
22                                  Herman, Miss. Kate      2           438
23                                  Delalic, Mr. Redjo      0           766
24                          Badman, Miss. Emily Louisa      0           661
25                         Sharp, Mr. Percival James R      0           556
26                            McGowan, Miss. Katherine      0          1008
27   Turpin, Mrs. William John Robert (Dorothy Ann ...      0           575
28                                 Doharr, Mr. Tannous      0           775
29                      Holverson, Mr. Alexander Oskar      0           162
..                                                 ...    ...           ...
429               Phillips, Miss. Alice Frances Louisa      1           533
430                          Mulvihill, Miss. Bertha E      0          1040
431                    Hamalainen, Mrs. William (Anna)      2           428
432           Rosblom, Mrs. Viktor (Helena Wilhelmina)      2          1158
433                                  Coxon, Mr. Daniel      0           736
434                       Oliva y Ocana, Dona. Fermina      0           218
435                          Karlsson, Mr. Nils August      0           915
436                   Collyer, Miss. Marjorie "Lottie"      2           377
437                     Edvardsson, Mr. Gustaf Hjalmar      0           786
438                               Daniels, Miss. Sarah      0            88
439                             Heikkinen, Miss. Laina      0           860
440                             Wiseman, Mr. Phillippe      0          1297
441                       Ibrahim Shawah, Mr. Yousseff      0           875
442       Greenfield, Mrs. Leo David (Blanche Strouse)      1           141
443                  Andrews, Miss. Kornelia Theodosia      0             6
444                           Bonnell, Miss. Elizabeth      0            33
445                                 Skoog, Miss. Mabel      2          1208
446                         Beauchamp, Mr. Henry James      0           338
447             Williams-Lambert, Mr. Fletcher Fellows      0           318
448                             Hunt, Mr. George Henry      0           457
449               Davidson, Mrs. Thornton (Orian Hays)      2            90
450                         Snyder, Mr. John Pillsbury      0           271
451                                   Miles, Mr. Frank      0          1018
452                            Wiklund, Mr. Karl Johan      0          1289
453                  Pears, Mrs. Thomas (Edith Wearne)      0           227
454                                 Sdycoff, Mr. Todor      0          1194
455                       Eitemiller, Mr. George Floyd      0           403
456                            Fleming, Miss. Margaret      0           108
457                           Mudd, Mr. Thomas Charles      0           510
458                          Van Impe, Miss. Catharina      2          1265

     pclass  sex  sibsp  survived            ticket
0         3    0      0       1.0            335432
1         3    1      0       0.0            315089
2         3    0      1       0.0            345773
3         2    0      1       1.0             29105
4         2    1      0       0.0             28221
5         3    1      0       0.0            C 4001
6         3    1      0       0.0              LINE
7         2    0      0       1.0            250648
8         3    0      0       1.0            347085
9         3    0      1       0.0              4137
10        1    1      0       0.0            113503
11        1    0      0       1.0             11813
12        1    0      0       1.0             11767
13        2    0      2       1.0             29105
14        3    1      1       0.0         C.A. 2673
15        3    1      0       0.0            350047
16        2    1      0       0.0            239059
17        3    1      2       1.0            367226
18        1    0      0       1.0            113505
19        3    1      0       1.0            347079
20        3    1      0       1.0            315098
21        3    1      0       0.0            330877
22        2    0      1       1.0            220845
23        3    1      0       0.0            349250
24        3    0      0       1.0         A/4 31416
25        2    1      0       0.0            244358
26        3    0      0       0.0              9232
27        2    0      1       0.0             11668
28        3    1      0       0.0              2686
29        1    1      1       0.0            113789
..      ...  ...    ...       ...               ...
429       2    0      0      -1.0       S.O./P.P. 2
430       3    0      0      -1.0            382653
431       2    0      0      -1.0            250649
432       3    0      0      -1.0            370129
433       3    1      0      -1.0            364500
434       1    0      0      -1.0          PC 17758
435       3    1      0      -1.0            350060
436       2    0      0      -1.0        C.A. 31921
437       3    1      0      -1.0            349912
438       1    0      0      -1.0            113781
439       3    0      0      -1.0  STON/O2. 3101282
440       3    1      0      -1.0        A/4. 34244
441       3    1      0      -1.0              2685
442       1    0      0      -1.0          PC 17759
443       1    0      1      -1.0             13502
444       1    0      0      -1.0            113783
445       3    0      3      -1.0            347088
446       2    1      0      -1.0            244358
447       1    1      0      -1.0            113510
448       2    1      0      -1.0        SCO/W 1585
449       1    0      1      -1.0        F.C. 12750
450       1    1      1      -1.0             21228
451       3    1      0      -1.0            359306
452       3    1      1      -1.0           3101266
453       1    0      1      -1.0            113776
454       3    1      0      -1.0            349222
455       2    1      0      -1.0             29751
456       1    0      0      -1.0             17421
457       2    1      0      -1.0       S.O./P.P. 3
458       3    0      0      -1.0            345773

[1309 rows x 15 columns]

In [10]:
#data.drop('name', axis = 1)
#data = data.drop('sibsp', axis = 1)
data = data.drop(['name', 'sibsp', 'ticket', 'cabin', 'body','home.dest'], axis = 1)

In [11]:
data.head()

   age boat embarked     fare  parch  passenger_id  pclass  sex  survived
0  1.0   13        Q   7.7333      0          1216       3    0       1.0
1  1.0    0        S   8.6625      0           699       3    1       0.0
2  1.0    0        S  24.1500      1          1267       3    0       0.0
3  2.0    4        S  23.0000      3           449       2    0       1.0
4  1.0    0        S  13.0000      0           576       2    1       0.0

To generate a tree, calculate the entropy of your parent nodes.
Tree 1 : gender - age - survival boolean
Tree 2 : age - gender - survival boolean
Tree 3 : fare - gender - age

In [12]:
data['sex'].value_counts()
#Female : 0, Male : 1

1    843
0    466
Name: sex, dtype: int64

In [13]:
data['sex'].value_counts(1)

1    0.644003
0    0.355997
Name: sex, dtype: float64

In [14]:
male_ratio = 0.644003
female_ratio = 0.355997

1. Calculate the entropy of the target:

    Calculate entropy of survival (1 - survived, 0 - did not survive, -1 - NA)

In [15]:
e_node = 0  #Initialize Entropy
values = data['survived'].value_counts() #Unique objects - -1,0,+1
for value in values:
    fraction = data['survived'].value_counts()/len(data['survived'])  
    e_node += -fraction*np.log2(fraction)
print(e_node)

 0.0    1.582043
-1.0    1.590439
 1.0    1.480758
Name: survived, dtype: float64

In [16]:
print(data['survived'].value_counts())
print("Total passengers")
print(len(data['survived']))

 0.0    537
-1.0    459
 1.0    313
Name: survived, dtype: int64
Total passengers
1309

In [17]:
data['survived'].value_counts(1)

 0.0    0.410237
-1.0    0.350649
 1.0    0.239114
Name: survived, dtype: float64

In [18]:
died =  0.410237
na_survived =  0.350649
lived = 0.239114
e_survived = -(died*log(died)) -(na_survived*log(na_survived)) -(lived*log(lived))
print(e_survived)

1.5510801153857858

In [19]:
e_survived_no_na = -(died*log(died))-(lived*log(lived))
print(e_survived_no_na)

1.0209337235439513

Entropy having value > 1 just shows a very high level of disorder. This implies that we can't accurately predict the state of the passenger and that the result of the execution of this model will be more informative.

In [20]:
# i being the information that number of dead gives us
# As the probability of a passenger not surviving is death_ratio < 1, these numbers give us high information
i = -log(died)
print(i)

1.285470477986138

As part of our first tree, we'll take Age as the parent node, split it to its different subgroups, which will be further split to sex, culminating in the survival of the passenger.

1. Get entropy of the parent as a whole
2. Get conditional entropy of subroups within parent
3. Find information gain by subtracting the weighted average of the conditional entropies from the parent's entropy

Example:
1. E(Age)
2. E(Age | Young), E(Age | Adult), E(Age | Old)
3. IG = E(Age) - E(weighted avg. conditional entropy)

In [21]:
data['age'].value_counts(1)

1.0    0.813598
0.0    0.102368
2.0    0.084034
Name: age, dtype: float64

In [22]:
e_age = -(0.813598*log(0.813598)) -(0.102368*log(0.102368)) - (0.084034*log(0.084034))
print(e_age)

0.87898284978781

In [23]:
e_age = 0  #Initialize Entropy
age_values = data['age'].value_counts() #Unique objects - -1,0,+1
for value in age_values:
    fraction = data['age'].value_counts()/len(data['age'])  
    e_age += -fraction*np.log2(fraction)
print(e_age)

1.0    0.726409
0.0    1.009809
2.0    0.900728
Name: age, dtype: float64

In [24]:
#Conditional entropy
#Young (0)| females(0) 
len(data.loc[(data['age'] == 0) & (data['sex'] == 0)])

64

In [25]:
#Young | Male
len(data.loc[(data['age'] == 0) & (data['sex'] == 1)])

70

In [26]:
num_young = len(data.loc[data['age'] == 0])
num_adult = len(data.loc[data['age'] == 1])
num_old = len(data.loc[data['age'] == 2])

In [27]:
print(num_old/total_pass)

0.08403361344537816

In [28]:
#Conditional entropy of Young(0) subgroup
#e_young = females/total young , males/total young
young_f = len(data.loc[(data['age'] == 0) & (data['sex'] == 0)])/num_young
young_m = len(data.loc[(data['age'] == 0) & (data['sex'] == 1)]) /num_young
e_young = -(young_f*log(young_f)) - (young_m*log(young_m))
print(e_young)

0.9985532860835362

In [29]:
#Conditional entropy of Adult (1) subgroup
adult_f = len(data.loc[(data['age'] == 1) & (data['sex'] == 0)]) / num_adult
adult_m = len(data.loc[(data['age'] == 1) & (data['sex'] == 1)]) / num_adult
e_adult = -(adult_f*log(adult_f)) -(adult_m*log(adult_m))
print(e_adult)

0.9265156836824285

In [30]:
#Conditional entropy of Old (2) subgroup
old_f = len(data.loc[(data['age'] == 2) & (data['sex'] == 0)]) / num_old
old_m = len(data.loc[(data['age'] == 2) & (data['sex'] == 1)]) / num_old
e_old = -(old_f*log(old_f)) -(old_m*log(old_m))
print(e_old)

0.9299429352091801

In [36]:
#Weighted avg entropy of age subgroups = total young / total passengers, total adult/ tot pass, total old/tot pass
ratio_y = num_young/total_pass
ratio_a = num_adult/total_pass
ratio_o = num_old/total_pass
e_age = -(ratio_y*log(ratio_y)) -(ratio_a*log(ratio_a))-(ratio_o*log(ratio_o))
print(e_age)

0.8789822416819767

In [37]:
e_wt_age = (ratio_y*e_young) + (ratio_a*e_adult) + (ratio_o*e_old)
print(e_wt_age)

0.9341780491443774

In [38]:
info_gain_age = e_age - e_wt_age
print(info_gain_age)

-0.055195807462400714